# Le commutateur ‚Äì VLAN, trunk, SVI, s√©curit√©

## üß± VLAN ‚Äì Virtual LAN

### D√©finition

- Segmentation logique du r√©seau sans ajout de mat√©riel
- Chaque VLAN = **domaine de broadcast isol√©**

### Avantages

|B√©n√©fice|Explication|
|---|---|
|S√©curit√©|Isolement des flux entre services|
|Performance|R√©duction du trafic inutile|
|Gestion|Regroupement logique d‚Äôutilisateurs|
|√âconomie|Un switch physique ‚Üí plusieurs LAN logiques|

### Types de VLAN

- **Donn√©es** : trafic utilisateurs (mail, web)
- **Voix** : QoS sp√©cifique pour la t√©l√©phonie (priorit√©, faible latence)
- **Gestion** : administration r√©seau (SSH, Telnet)
- **Par d√©faut** : VLAN 1, utilis√© √† la sortie d‚Äôusine
- **Natif** : VLAN non tagu√© sur trunk (souvent VLAN 1, √† changer pour des raisons de s√©curit√©)

---

## üîß Commandes VLAN

### Cr√©ation d‚Äôun VLAN

```shell
Switch(config)# vlan 30
Switch(config-vlan)# name Administration
```

### Affectation d‚Äôun port √† un VLAN

```shell
Switch(config)# interface FastEthernet 0/1
Switch(config-if)# switchport mode access
Switch(config-if)# switchport access vlan 30
```

### V√©rification

```shell
Switch# show vlan brief
```

---

## üîÅ Trunks (liaisons inter-switches)

### R√¥le

- Transportent **plusieurs VLANs** sur un m√™me lien physique
- Utilisent **802.1Q** pour taguer les trames

### Configuration

```shell
Switch(config)# interface fa0/1
Switch(config-if)# switchport mode trunk
Switch(config-if)# switchport trunk native vlan 99
Switch(config-if)# switchport trunk allowed vlan 10,20,30
```

### V√©rification

```shell
Switch# show interface fa0/1 switchport
```

---

## üåê SVI ‚Äì Interface VLAN pour l‚Äôadministration

- Interface logique associ√©e √† un VLAN sur le switch
- N√©cessaire pour **acc√©der au switch √† distance** (via IP)

### Configuration

```shell
Switch(config)# interface vlan 10
Switch(config-if)# ip address 192.168.10.2 255.255.255.0
Switch(config-if)# no shutdown
```

---

## üîê S√©curisation du commutateur

### Recommandations cl√©s

- **Supprimer ou d√©sactiver les ports inutilis√©s**
- **Changer le VLAN natif** et √©viter l‚Äôusage du **VLAN 1**
- **Forcer l‚Äôutilisation de SSH** (et non Telnet)

### Activer l‚Äôacc√®s SSH s√©curis√©

```shell
Switch(config)# ip domain-name entreprise.local
Switch(config)# crypto key generate rsa
Switch(config)# username admin secret MonMotDePasseFort
Switch(config-line)# line vty 0 15
Switch(config-line)# login local
Switch(config-line)# transport input ssh
Switch(config)# ip ssh version 2
```

---

## ‚úÖ √Ä retenir pour les r√©visions

- Un **VLAN** segmente le r√©seau sans mat√©riel suppl√©mentaire
- Un **SVI** est n√©cessaire pour l‚Äôacc√®s IP au switch
- Un **trunk** transporte plusieurs VLANs entre les switches
- Le **VLAN natif** ne doit pas √™tre utilis√© pour les donn√©es utilisateurs
- Le protocole **SSH** est obligatoire pour les connexions distantes s√©curis√©es

---

## üìå Bonnes pratiques professionnelles

- Toujours **changer le VLAN natif** et **d√©sactiver les ports inutiles**
- S√©parer les flux **voix, donn√©es, administration** sur des VLANs d√©di√©s
- Utiliser des **trunks** pour interconnecter les switches
- Mettre en place une **authentification SSH** et des mots de passe complexes
- **Documenter** chaque VLAN, port, et r√¥le associ√© dans un fichier d‚Äôarchitecture r√©seau