# Le routeur ‚Äì Configuration, routage, inter-VLAN
## üõ†Ô∏è Configuration de base d‚Äôun routeur

- Structure et fonctionnement tr√®s proches du switch :
    - M√™me modes (utilisateur, privil√©gi√©, global)
    - M√™mes lignes de configuration (`console`, `vty`)
    - M√™mes m√©moires : ROM, Flash, RAM, NVRAM

### Configuration d‚Äôune interface IP

```shell
Router(config)# interface g0/0
Router(config-if)# ip address 192.168.1.1 255.255.255.0
Router(config-if)# no shutdown
Router(config-if)# description Lien vers LAN1
```

---

## üß≠ Routage statique

### Principe

- L‚Äôh√¥te consulte sa **passerelle par d√©faut** si le destinataire n‚Äôest pas sur le m√™me r√©seau logique.
- Chaque routeur examine sa **table de routage** pour transmettre le paquet au prochain saut (next hop).
- **TTL** d√©cr√©ment√© √† chaque saut : si = 0 ‚Üí paquet abandonn√©.

### Cr√©ation d‚Äôune route statique

```shell
Router(config)# ip route 192.168.10.0 255.255.255.0 10.0.0.254
```

### Route par d√©faut

```shell
Router(config)# ip route 0.0.0.0 0.0.0.0 192.168.1.1
```

---

## üìã Table de routage

|√âl√©ment|Description|
|---|---|
|`C`|Route connect√©e directement|
|`L`|Adresse locale (interface elle-m√™me)|
|`S`|Route statique|
|`R`|RIP (routing protocol)|

- **Distance administrative** (DA) : confiance accord√©e √† la source (plus petite = plus fiable)
- **M√©trique** : crit√®re pour choisir entre plusieurs routes (nombre de sauts, bande passante, etc.)

### Valeurs de DA usuelles

|Protocole|DA|
|---|---|
|Connexion directe|0|
|Route statique|1|
|EIGRP interne|90|
|OSPF|110|
|RIP|120|

---

## üîÄ Routage inter-VLAN ‚Äì Router-on-a-Stick

### Principe

- Utilise **une seule interface physique** avec **plusieurs sous-interfaces logiques**, une par VLAN
- Chaque sous-interface est tagu√©e avec un VLAN (`dot1q`) et re√ßoit une IP de passerelle

### Configuration

```shell
interface g0/0.10
 encapsulation dot1q 10
 ip address 192.168.10.1 255.255.255.0
!
interface g0/0.20
 encapsulation dot1q 20
 ip address 192.168.20.1 255.255.255.0
!
interface g0/0.99
 encapsulation dot1q 99 native
 ip address 192.168.99.1 255.255.255.0
```

> Le trunk sur le switch doit correspondre √† cette configuration (m√™mes VLANs autoris√©s)

---

## üåê Protocole RIP (Routing Information Protocol)

### Caract√©ristiques

- Protocole de **routage dynamique** standard (RIPv2)
- IGP / Distance vector
- Distance administrative : 120
- M√©trique : nombre de sauts (max 15)

### Configuration

```shell
Router(config)# router rip
Router(config-router)# version 2
Router(config-router)# network 10.0.0.0
Router(config-router)# network 192.168.1.0
```

### Multidiffusion RIP v2

- Envoi toutes les 30 secondes en **multicast** : 224.0.0.9
- RIP v1 utilisait le **broadcast** : 255.255.255.255

---

## ‚úÖ √Ä retenir pour les r√©visions

- Le routage statique est **manuel**, s√ªr mais rigide
- La **distance administrative** classe les sources de routage par fiabilit√©
- Le **Router-on-a-Stick** permet le **routage inter-VLAN avec une seule interface physique**
- **RIP v2** permet un routage dynamique simple pour les topologies modestes

---

## üìå Bonnes pratiques professionnelles

- Toujours **d√©crire les interfaces** (`description`) pour le support
- Utiliser `show ip route` et `show running-config` pour diagnostiquer
- Limiter RIP √† des **labos ou r√©seaux simples**, pr√©f√©rer OSPF/EIGRP en prod
- √âviter d‚Äôutiliser `RIP v1` (non s√©curis√©, sans support CIDR ni VLSM)
- **Documenter le plan de routage** (routes, sous-r√©seaux, interconnexions)
- V√©rifier la correspondance **trunk ‚Üî sous-interfaces VLAN** pour le router-on-a-stick